XML-SOAP-SERVER/requestDel.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://manyroads.dev/customers">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:deleteCustomerByIdRequest>
            <gs:custId>1
            </gs:custId>
        </gs:deleteCustomerByIdRequest>
    </soapenv:Body>
</soapenv:Envelope>